cases/eye-vitreous-ac-tc0/fluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// eye-vitreous-ac-tc0: FLUID domain — 2D rectangular cross-section.
//
// Coordinate system:
//   x = posterior→anterior  (0 → 20 mm)
//   y = inferior→superior   (0 → 24 mm)
//   z = 0 → 1 mm            (thin slice → 2-D simulation)
//
// x-partition: 0, 5, 15, 20  mm   →  3 columns
// y-partition: 0, 2.40, 3.00, 3.16, 4.80, 7.20, 9.60, 14.40, 18.00, 21.92, 22.08, 24.00 mm
//              →  11 rows  (j=0..10)
//
// Solid dents:
//   Lens  x=[0,15mm],  y=[9.60,14.40mm]
//   Iris  x=[5,20mm],  y=[4.80, 7.20mm]
//
// Key patches:
//   needle_outlet  x=0,    y=[3.00, 3.16mm]   D_int=0.16mm, centred y≈3.08mm
//   outlet_tm      x=20mm, y=[0,    2.40mm]   2.4mm near inferior wall
//   ac_inlet       x=20mm, y=[7.20, 9.60mm]   2.4mm
//   needle_inlet   x=0,    y=[21.92,22.08mm]  D_int=0.16mm, centred y=22mm
//   sclera_right   x=20mm, y=[2.40,4.80mm] ∪ [9.60,24mm]
//
// Vertex numbering:
//   z=0: v(i,j) = i + j*4   i=0..3, j=0..11  →  v0..v47
//   z=1: same + 48                             → v48..v95
//
// Grid (11 rows × 3 cols, solids excluded):
//   row10 y=[22.08,24.00]  B26      B27      B28
//   row 9 y=[21.92,22.08]  B23(ndl) B24      B25
//   row 8 y=[18.00,21.92]  B20      B21      B22
//   row 7 y=[14.40,18.00]  B17      B18      B19
//   row 6 y=[9.60,14.40]   LENS     LENS     B16
//   row 5 y=[7.20, 9.60]   B13      B14      B15(ac)
//   row 4 y=[4.80, 7.20]   B12      IRIS     IRIS
//   row 3 y=[3.16, 4.80]   B09      B10      B11
//   row 2 y=[3.00, 3.16]   B06(ndl) B07      B08
//   row 1 y=[2.40, 3.00]   B03      B04      B05
//   row 0 y=[0,    2.40]   B00      B01      B02(tm)

scale   1;

// ── Vertices ──────────────────────────────────────────────────────────────────
// y [m]: y0=0  y1=0.00240  y2=0.00300  y3=0.00316  y4=0.00480
//        y5=0.00720  y6=0.00960  y7=0.01440  y8=0.01800
//        y9=0.02192  y10=0.02208  y11=0.02400

vertices
(
    // ── z = 0 layer ────────────────────────────────────────── v0 – v47

    // j=0  y = 0
    ( 0.000  0.000000  0.000 )  //  0
    ( 0.005  0.000000  0.000 )  //  1
    ( 0.015  0.000000  0.000 )  //  2
    ( 0.020  0.000000  0.000 )  //  3

    // j=1  y = 2.40 mm  (outlet_tm top)
    ( 0.000  0.002400  0.000 )  //  4
    ( 0.005  0.002400  0.000 )  //  5
    ( 0.015  0.002400  0.000 )  //  6
    ( 0.020  0.002400  0.000 )  //  7

    // j=2  y = 3.00 mm  (needle_outlet bottom)
    ( 0.000  0.003000  0.000 )  //  8
    ( 0.005  0.003000  0.000 )  //  9
    ( 0.015  0.003000  0.000 )  // 10
    ( 0.020  0.003000  0.000 )  // 11

    // j=3  y = 3.16 mm  (needle_outlet top)
    ( 0.000  0.003160  0.000 )  // 12
    ( 0.005  0.003160  0.000 )  // 13
    ( 0.015  0.003160  0.000 )  // 14
    ( 0.020  0.003160  0.000 )  // 15

    // j=4  y = 4.80 mm  (iris bottom)
    ( 0.000  0.004800  0.000 )  // 16
    ( 0.005  0.004800  0.000 )  // 17
    ( 0.015  0.004800  0.000 )  // 18
    ( 0.020  0.004800  0.000 )  // 19

    // j=5  y = 7.20 mm  (iris top / ac_inlet bottom)
    ( 0.000  0.007200  0.000 )  // 20
    ( 0.005  0.007200  0.000 )  // 21
    ( 0.015  0.007200  0.000 )  // 22
    ( 0.020  0.007200  0.000 )  // 23

    // j=6  y = 9.60 mm  (lens bottom / ac_inlet top)
    ( 0.000  0.009600  0.000 )  // 24
    ( 0.005  0.009600  0.000 )  // 25
    ( 0.015  0.009600  0.000 )  // 26
    ( 0.020  0.009600  0.000 )  // 27

    // j=7  y = 14.40 mm  (lens top)
    ( 0.000  0.014400  0.000 )  // 28
    ( 0.005  0.014400  0.000 )  // 29
    ( 0.015  0.014400  0.000 )  // 30
    ( 0.020  0.014400  0.000 )  // 31

    // j=8  y = 18.00 mm
    ( 0.000  0.018000  0.000 )  // 32
    ( 0.005  0.018000  0.000 )  // 33
    ( 0.015  0.018000  0.000 )  // 34
    ( 0.020  0.018000  0.000 )  // 35

    // j=9  y = 21.92 mm  (needle_inlet bottom)
    ( 0.000  0.021920  0.000 )  // 36
    ( 0.005  0.021920  0.000 )  // 37
    ( 0.015  0.021920  0.000 )  // 38
    ( 0.020  0.021920  0.000 )  // 39

    // j=10  y = 22.08 mm  (needle_inlet top)
    ( 0.000  0.022080  0.000 )  // 40
    ( 0.005  0.022080  0.000 )  // 41
    ( 0.015  0.022080  0.000 )  // 42
    ( 0.020  0.022080  0.000 )  // 43

    // j=11  y = 24.00 mm  (top)
    ( 0.000  0.024000  0.000 )  // 44
    ( 0.005  0.024000  0.000 )  // 45
    ( 0.015  0.024000  0.000 )  // 46
    ( 0.020  0.024000  0.000 )  // 47

    // ── z = 1 mm layer ────────────────────────────────────── v48 – v95
    ( 0.000  0.000000  0.001 )( 0.005  0.000000  0.001 )( 0.015  0.000000  0.001 )( 0.020  0.000000  0.001 )  // 48-51
    ( 0.000  0.002400  0.001 )( 0.005  0.002400  0.001 )( 0.015  0.002400  0.001 )( 0.020  0.002400  0.001 )  // 52-55
    ( 0.000  0.003000  0.001 )( 0.005  0.003000  0.001 )( 0.015  0.003000  0.001 )( 0.020  0.003000  0.001 )  // 56-59
    ( 0.000  0.003160  0.001 )( 0.005  0.003160  0.001 )( 0.015  0.003160  0.001 )( 0.020  0.003160  0.001 )  // 60-63
    ( 0.000  0.004800  0.001 )( 0.005  0.004800  0.001 )( 0.015  0.004800  0.001 )( 0.020  0.004800  0.001 )  // 64-67
    ( 0.000  0.007200  0.001 )( 0.005  0.007200  0.001 )( 0.015  0.007200  0.001 )( 0.020  0.007200  0.001 )  // 68-71
    ( 0.000  0.009600  0.001 )( 0.005  0.009600  0.001 )( 0.015  0.009600  0.001 )( 0.020  0.009600  0.001 )  // 72-75
    ( 0.000  0.014400  0.001 )( 0.005  0.014400  0.001 )( 0.015  0.014400  0.001 )( 0.020  0.014400  0.001 )  // 76-79
    ( 0.000  0.018000  0.001 )( 0.005  0.018000  0.001 )( 0.015  0.018000  0.001 )( 0.020  0.018000  0.001 )  // 80-83
    ( 0.000  0.021920  0.001 )( 0.005  0.021920  0.001 )( 0.015  0.021920  0.001 )( 0.020  0.021920  0.001 )  // 84-87
    ( 0.000  0.022080  0.001 )( 0.005  0.022080  0.001 )( 0.015  0.022080  0.001 )( 0.020  0.022080  0.001 )  // 88-91
    ( 0.000  0.024000  0.001 )( 0.005  0.024000  0.001 )( 0.015  0.024000  0.001 )( 0.020  0.024000  0.001 )  // 92-95
);

// ── Blocks ────────────────────────────────────────────────────────────────────
// y cells: row0=5(2.40mm) row1=2(0.60mm) row2=1(0.16mm) row3=4(1.64mm)
//          row4=5(2.40mm) row5=5(2.40mm) row6=10(4.80mm) row7=7(3.60mm)
//          row8=8(3.92mm) row9=1(0.16mm) row10=4(1.92mm)

blocks
(
    // ── Row 0: y=[0, 2.40mm] — outlet_tm zone ────────────────────────────
    hex (  0  1  5  4    48 49 53 52 )  ( 10  5 1 )  simpleGrading ( 1 1 1 )  // B00
    hex (  1  2  6  5    49 50 54 53 )  ( 20  5 1 )  simpleGrading ( 1 1 1 )  // B01
    hex (  2  3  7  6    50 51 55 54 )  ( 10  5 1 )  simpleGrading ( 1 1 1 )  // B02  right=outlet_tm

    // ── Row 1: y=[2.40, 3.00mm] — between outlet_tm and needle_outlet ─────
    hex (  4  5  9  8    52 53 57 56 )  ( 10  2 1 )  simpleGrading ( 1 1 1 )  // B03
    hex (  5  6 10  9    53 54 58 57 )  ( 20  2 1 )  simpleGrading ( 1 1 1 )  // B04
    hex (  6  7 11 10    54 55 59 58 )  ( 10  2 1 )  simpleGrading ( 1 1 1 )  // B05

    // ── Row 2: y=[3.00, 3.16mm] — needle_outlet strip (0.16mm) ──────────
    hex (  8  9 13 12    56 57 61 60 )  ( 10  1 1 )  simpleGrading ( 1 1 1 )  // B06  left=needle_outlet
    hex (  9 10 14 13    57 58 62 61 )  ( 20  1 1 )  simpleGrading ( 1 1 1 )  // B07
    hex ( 10 11 15 14    58 59 63 62 )  ( 10  1 1 )  simpleGrading ( 1 1 1 )  // B08

    // ── Row 3: y=[3.16, 4.80mm] — below iris ─────────────────────────────
    hex ( 12 13 17 16    60 61 65 64 )  ( 10  4 1 )  simpleGrading ( 1 1 1 )  // B09
    hex ( 13 14 18 17    61 62 66 65 )  ( 20  4 1 )  simpleGrading ( 1 1 1 )  // B10
    hex ( 14 15 19 18    62 63 67 66 )  ( 10  4 1 )  simpleGrading ( 1 1 1 )  // B11

    // ── Row 4: y=[4.80, 7.20mm] — iris level ─────────────────────────────
    hex ( 16 17 21 20    64 65 69 68 )  ( 10  5 1 )  simpleGrading ( 1 1 1 )  // B12  right=iris_wall left
    // col1, col2 → IRIS SOLID

    // ── Row 5: y=[7.20, 9.60mm] — gap above iris, below lens ─────────────
    hex ( 20 21 25 24    68 69 73 72 )  ( 10  5 1 )  simpleGrading ( 1 1 1 )  // B13
    hex ( 21 22 26 25    69 70 74 73 )  ( 20  5 1 )  simpleGrading ( 1 1 1 )  // B14
    hex ( 22 23 27 26    70 71 75 74 )  ( 10  5 1 )  simpleGrading ( 1 1 1 )  // B15  right=ac_inlet

    // ── Row 6: y=[9.60, 14.40mm] — lens level ────────────────────────────
    // col0, col1 → LENS SOLID
    hex ( 26 27 31 30    74 75 79 78 )  ( 10 10 1 )  simpleGrading ( 1 1 1 )  // B16  left=lens_wall right

    // ── Row 7: y=[14.40, 18.00mm] — above lens ───────────────────────────
    hex ( 28 29 33 32    76 77 81 80 )  ( 10  7 1 )  simpleGrading ( 1 1 1 )  // B17
    hex ( 29 30 34 33    77 78 82 81 )  ( 20  7 1 )  simpleGrading ( 1 1 1 )  // B18
    hex ( 30 31 35 34    78 79 83 82 )  ( 10  7 1 )  simpleGrading ( 1 1 1 )  // B19

    // ── Row 8: y=[18.00, 21.92mm] — below needle_inlet ───────────────────
    hex ( 32 33 37 36    80 81 85 84 )  ( 10  8 1 )  simpleGrading ( 1 1 1 )  // B20
    hex ( 33 34 38 37    81 82 86 85 )  ( 20  8 1 )  simpleGrading ( 1 1 1 )  // B21
    hex ( 34 35 39 38    82 83 87 86 )  ( 10  8 1 )  simpleGrading ( 1 1 1 )  // B22

    // ── Row 9: y=[21.92, 22.08mm] — needle_inlet strip (0.16mm) ─────────
    hex ( 36 37 41 40    84 85 89 88 )  ( 10  1 1 )  simpleGrading ( 1 1 1 )  // B23  left=needle_inlet
    hex ( 37 38 42 41    85 86 90 89 )  ( 20  1 1 )  simpleGrading ( 1 1 1 )  // B24
    hex ( 38 39 43 42    86 87 91 90 )  ( 10  1 1 )  simpleGrading ( 1 1 1 )  // B25

    // ── Row 10: y=[22.08, 24.00mm] — above needle_inlet ──────────────────
    hex ( 40 41 45 44    88 89 93 92 )  ( 10  4 1 )  simpleGrading ( 1 1 1 )  // B26
    hex ( 41 42 46 45    89 90 94 93 )  ( 20  4 1 )  simpleGrading ( 1 1 1 )  // B27
    hex ( 42 43 47 46    90 91 95 94 )  ( 10  4 1 )  simpleGrading ( 1 1 1 )  // B28
);

edges   ();

boundary
(
    // ── needle_inlet — 0.16mm centred at y=22mm ──────────────────────────
    needle_inlet
    {
        type patch;
        faces ( ( 36 40 88 84 ) );
    }

    // ── needle_outlet — 0.16mm centred at y≈3.08mm ───────────────────────
    needle_outlet
    {
        type patch;
        faces ( (  8 12 60 56 ) );  // B06 left  y=[3.00,3.16mm]
    }

    // ── sclera_left — left wall excluding needle patches ──────────────────
    sclera_left
    {
        type wall;
        faces
        (
            (  0  4 52 48 )   // B00  y=[0,    2.40mm]
            (  4  8 56 52 )   // B03  y=[2.40, 3.00mm]
            ( 12 16 64 60 )   // B09  y=[3.16, 4.80mm]
            ( 16 20 68 64 )   // B12  y=[4.80, 7.20mm]
            ( 20 24 72 68 )   // B13  y=[7.20, 9.60mm]
            ( 28 32 80 76 )   // B17  y=[14.40,18.00mm]
            ( 32 36 84 80 )   // B20  y=[18.00,21.92mm]
            ( 40 44 92 88 )   // B26  y=[22.08,24.00mm]
        );
    }

    // ── sclera_top ────────────────────────────────────────────────────────
    sclera_top
    {
        type wall;
        faces
        (
            ( 44 45 93 92 )
            ( 45 46 94 93 )
            ( 46 47 95 94 )
        );
    }

    // ── sclera_bot ────────────────────────────────────────────────────────
    sclera_bot
    {
        type wall;
        faces
        (
            (  0  1 49 48 )
            (  1  2 50 49 )
            (  2  3 51 50 )
        );
    }

    // ── sclera_right — right wall excluding outlet_tm and ac_inlet ────────
    sclera_right
    {
        type wall;
        faces
        (
            (  7 11 59 55 )   // B05  y=[2.40, 3.00mm]
            ( 11 15 63 59 )   // B08  y=[3.00, 3.16mm]
            ( 15 19 67 63 )   // B11  y=[3.16, 4.80mm]
            ( 27 31 79 75 )   // B16  y=[9.60,14.40mm]
            ( 31 35 83 79 )   // B19  y=[14.40,18.00mm]
            ( 35 39 87 83 )   // B22  y=[18.00,21.92mm]
            ( 39 43 91 87 )   // B25  y=[21.92,22.08mm]
            ( 43 47 95 91 )   // B28  y=[22.08,24.00mm]
        );
    }

    // ── lens_wall ─────────────────────────────────────────────────────────
    lens_wall
    {
        type wall;
        faces
        (
            ( 24 25 73 72 )   // B13 top  — lens bottom x=[0,5]
            ( 25 26 74 73 )   // B14 top  — lens bottom x=[5,15]
            ( 26 30 78 74 )   // B16 left — lens right  y=[9.6,14.4]
            ( 28 29 77 76 )   // B17 bot  — lens top    x=[0,5]
            ( 29 30 78 77 )   // B18 bot  — lens top    x=[5,15]
        );
    }

    // ── iris_wall ─────────────────────────────────────────────────────────
    iris_wall
    {
        type wall;
        faces
        (
            ( 17 18 66 65 )   // B10 top  — iris bottom x=[5,15]
            ( 18 19 67 66 )   // B11 top  — iris bottom x=[15,20]
            ( 17 21 69 65 )   // B12 right — iris left  y=[4.80,7.20mm]
            ( 21 22 70 69 )   // B14 bot  — iris top    x=[5,15]
            ( 22 23 71 70 )   // B15 bot  — iris top    x=[15,20]
        );
    }

    // ── ac_inlet — right wall y=[7.20,9.60mm], 2.4mm ─────────────────────
    ac_inlet
    {
        type patch;
        faces ( ( 23 27 75 71 ) );
    }

    // ── outlet_tm — right wall y=[0,2.40mm], 2.4mm ───────────────────────
    outlet_tm
    {
        type patch;
        faces ( (  3  7 55 51 ) );
    }

    // ── front / back — empty (2D) ─────────────────────────────────────────
    front
    {
        type empty;
        faces
        (
            (  0  1  5  4 )( 1  2  6  5 )( 2  3  7  6 )   // row 0
            (  4  5  9  8 )( 5  6 10  9 )( 6  7 11 10 )   // row 1
            (  8  9 13 12 )( 9 10 14 13 )(10 11 15 14 )   // row 2
            ( 12 13 17 16 )(13 14 18 17 )(14 15 19 18 )   // row 3
            ( 16 17 21 20 )                                 // row 4 col0
            ( 20 21 25 24 )(21 22 26 25 )(22 23 27 26 )   // row 5
            ( 26 27 31 30 )                                 // row 6 col2
            ( 28 29 33 32 )(29 30 34 33 )(30 31 35 34 )   // row 7
            ( 32 33 37 36 )(33 34 38 37 )(34 35 39 38 )   // row 8
            ( 36 37 41 40 )(37 38 42 41 )(38 39 43 42 )   // row 9
            ( 40 41 45 44 )(41 42 46 45 )(42 43 47 46 )   // row 10
        );
    }

    back
    {
        type empty;
        faces
        (
            ( 48 49 53 52 )(49 50 54 53 )(50 51 55 54 )
            ( 52 53 57 56 )(53 54 58 57 )(54 55 59 58 )
            ( 56 57 61 60 )(57 58 62 61 )(58 59 63 62 )
            ( 60 61 65 64 )(61 62 66 65 )(62 63 67 66 )
            ( 64 65 69 68 )
            ( 68 69 73 72 )(69 70 74 73 )(70 71 75 74 )
            ( 74 75 79 78 )
            ( 76 77 81 80 )(77 78 82 81 )(78 79 83 82 )
            ( 80 81 85 84 )(81 82 86 85 )(82 83 87 86 )
            ( 84 85 89 88 )(85 86 90 89 )(86 87 91 90 )
            ( 88 89 93 92 )(89 90 94 93 )(90 91 95 94 )
        );
    }
);
