cases/eye-vitreous-ac-tc0/fluid/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

// eye-vitreous-ac-tc0
//
// Euler ddt (1st-order implicit) for tc0 stability.
// Switch to 'backward' (2nd-order, matching Fluent) in later tcs.
//
// Linear div for momentum: Re_eye << 1 (creeping flow), so central
// differencing is accurate and upwind would be overly diffusive.

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
